# Словарь городов и комплексов
city_complexes = {
    'Тюмень': [
        'Кварталы "На Минской"', 'Республики 205', 'Октябрьский на Туре', 'Зарека ',
        'Речной Порт', 'Европейский квартал', 'На Гастелло', 'Дом у озера',
        '1А Первомайская', 'Октябрьский', 'Видный', 'Новин'
    ],
    'Москва': [
        'Первый квартал', 'Квартал "Метроном"', 'Квартал "Издание"',
        'Квартал "Монс"', 'Дом "А"'
    ],
    'Новосибирск': [
        'Европейский берег', 'Пшеница', 'Авиатор', 'Мылзавод',
        'На Никитина', 'На Декабристов', 'Дунаевский', 'Панорама'
    ],
    'Сургут': [
        'Квартал Нефть', 'Новин', 'Гудзон', 'Дом на Комсомольском'
    ],
    'Курган': ['Резиденция'],
    'Екатеринбург': [
        'Квартал "Депо"', 'Северный квартал', 'Южный квартал',
        'Брусника в Академическом', 'Шишимская горка', 'На Некрасова',
        'Суходольский', 'Каменный ручей', 'Кандинский', 'Солнечный', 'Новаторов'
    ]
}

# Словарь комплексов и улиц
complex_streets = {
    'Новин': ['Нет данных', 'Нет данных'],
    'Первый квартал': ['Нет данных'],
    'Квартал "Метроном"': ['Нет данных'],
    'Квартал "Издание"': ['Нет данных'],
    'Квартал "Монс"': ['Нет данных'],
    'Дом "А"': ['Нет данных'],
    'Европейский берег': ['Нет данных'],
    'Пшеница': ['Нет данных'],
    'Авиатор': ['Нет данных'],
    'Мылзавод': ['Нет данных'],
    'На Никитина': ['Нет данных'],
    'На Декабристов': ['Нет данных'],
    'Дунаевский': ['Нет данных'],
    'Панорама': ['Нет данных'],
    'Квартал Нефть': ['Нет данных'],
    'Гудзон': ['Нет данных'],
    'Дом на Комсомольском': ['Нет данных'],
    'Резиденция': ['Нет данных'],
    'Квартал "Депо"': ['ул. Пехотинцев'],
    'Северный квартал': ['ул. Войкова', 'ул. Ритслянда', 'ул. Стачек'],
    'Южный квартал': ['ул. Чкалова', 'ул. Шаумяна'],
    'Брусника в Академическом': ['ул. Академика Ландау'],
    'Шишимская горка': ['ул. Гастелло', 'ул. Мраморская'],
    'На Некрасова': ['ул. Печерская'],
    'Суходольский': ['ул. Евгения Савкова'],
    'Каменный ручей': ['ул. Щербакова'],
    'Кандинский': ['ул. Гоголя'],
    'Солнечный': ['Нет данных'],
    'Новаторов': ['ул. Новаторов']
}
