category_keywords = {
    "1": ["освещение", "площадка", "снег", "мусор", "парковка", "опасные объекты"],  # Проблемы с придомовой территорией
    "2": ["отопление", "водоснабжение", "кровля", "лифты", "подъезд", "трубопровод"],  # Проблемы с внутридомовой территорией
    "3": ["квитанция", "платеж", "сумма", "ошибка", "аренда", "долг"],  # Проблемы с квитанциями
    "5": ["коммунальные услуги", "отопление", "свет", "подача воды", "счетчики"],  # Оказание коммунальных услуг
    "6": ["ремонт", "техническое обслуживание", "услуги", "проводка"],  # Услуги по ремонту
    "7": ["информация", "нормативы", "фонд капитального ремонта"],  # Информация по ЖКХ
}

# Список категорий с отведенным временем на решение
category_deadlines = {
    "1": 1,  # 1 день для проблем с придомовой территорией
    "2": 1,  # 1 день для проблем с внутридомовой территорией
    "3": 1,  # 1 день для проблем с квитанциями
    "5": 1,  # 1 день для оказания коммунальных услуг
    "6": 1,  # 1 день для оказания услуг по ремонту
    "7": 1,  # 1 день для предоставления информации
    "8": 1,  # 1 день для предоставления информации
    "9": 1,  # 1 день для предоставления информации
    "10": 1,  # 1 день для предоставления информации
    "11": 1,  # 1 день для предоставления информации
    "12": 1,  # 1 день для предоставления информации
    "13": 1,  # 1 день для предоставления информации
    "14": 1,  # 1 день для предоставления информации
    "15": 1,  # 1 день для предоставления информации
    "16": 1,  # 1 день для предоставления информации
}


